#include <stdio.h>
#include <conio.h>
#include "Create_struct_header.h"

void listing(struct muz_akk* h,struct muz_akk* p)
{
	struct muz_akk* tmp; 
	struct muz_akk* tmp2; // Запоминаем положение головы для невозможности листинга назад на первой странице
	struct muz_akk* tmp3;
	struct muz_akk* t1; // Указатели вывода
	struct muz_akk* t2;
	int i = 0;
	int j; // Код символа
	tmp3 = p; // Помещаем начальное положение головы(начало списка)
	tmp = h; // Помещаем начальное положение головы(конец списка)
	printf("--------------------------------------------------------------------------------");
	printf("|Аккорд\t|Тон\t|Тональность\t|Частота(ГЦ)\t|Разрешение\t|Гамма\t|Ступень");
	printf("--------------------------------------------------------------------------------");
	t1 = h->next;
	t2 = p->prev;
	for(i=0;i<5;i++)  // Выводим первые 5 элементов
	{
		h = h->next;
		printf("|%s\t|%s\t|%s\t\t|%d\t\t|%s\t\t|%s\t|%d\n",p->name,p->osn_ton,p->tonal,p->frequency,p->razr_name,p->gamma,p->stupen); // Выводим снизу вверх
		p = p->prev; // Идем по списку вверх т.к. он считывается перевернуто
	}
	tmp2 = h;
	h = t1; // Ставим  голову на следующий элемент после 1-го
	p = t2;
	printf("--------------------------------------------------------------------------------");
	printf("\nНазад(стрелка вверх) Вперед(вниз) q - для выхода\n");
	j = 0;
	while(j!='q' && j!='Q')
	{
		j = 0;
		while(j!=72 && j!=80 && j!='q' && j!='Q')	j = getch(); // Пока не введен нужный символ(72 вверх 80 вниз 75 влево 77 вправо)
		if(j==80) // Движение вниз по списку
		{
			if(h->next->next->next==tmp3) continue; // Если обнаружен последний элемент
			system("cls");
			t1 = h->next;
			t2 = p->prev;
			printf("--------------------------------------------------------------------------------");
			printf("|Аккорд\t|Тон\t|Тональность\t|Частота(ГЦ)\t|Разрешение\t|Гамма\t|Ступень");
			printf("--------------------------------------------------------------------------------");
			for(i=0;i<5;i++)
			{
				h = h->next;
				printf("|%s\t|%s\t|%s\t\t|%d\t\t|%s\t\t|%s\t|%d\n",p->name,p->osn_ton,p->tonal,p->frequency,p->razr_name,p->gamma,p->stupen); // Выводим снизу вверх
				p = p->prev; // Идем по списку вверх т.к. он считывается перевернуто
			}
			printf("--------------------------------------------------------------------------------");
			printf("\nНазад(стрелка вверх) Вперед(вниз) q - для выхода\n");
			h = t1;
			p = t2;
		}
		if(j==72) // Движение вниз по списку
		{
			if(h->prev==tmp) continue; // Если обнаружен первый элемент
			system("cls");
			printf("--------------------------------------------------------------------------------");
			printf("|Аккорд\t|Тон\t|Тональность\t|Частота(ГЦ)\t|Разрешение\t|Гамма\t|Ступень");
			printf("--------------------------------------------------------------------------------");
			i = 0;
			h = h->prev->prev;
			p = p->next->next;
			t1 = h->next;
			t2 = p->prev;
			while(i!=5 && h!=NULL && p!=NULL)
			{
				h = h->next;
				printf("|%s\t|%s\t|%s\t\t|%d\t\t|%s\t\t|%s\t|%d\n",p->name,p->osn_ton,p->tonal,p->frequency,p->razr_name,p->gamma,p->stupen); // Выводим снизу вверх
				p = p->prev;
				i++;
			}
			i = 0;
			printf("--------------------------------------------------------------------------------");
			printf("\nНазад(стрелка вверх) Вперед(вниз) q - для выхода\n");
			h = t1;
			p = t2;
		}
	}
	// Очистка памяти
	h = tmp;  // Восстанавливаем начальное положение головы
	while(h!=NULL) // Пока существует следующая структура
	{
		struct muz_akk* temp; // Переменная хранения следующих эл-тов списка
		temp = h->next;
		free(h);
		h = temp;
	}
	printf("\n");
	system("cls");
}