#include <stdio.h>
#include "Empty_file.h"

void proverka_file()
{
	FILE* file;
	int l,i;
	int m = 1; // Существовал ли файл (0) нет, (1) да
	char c;
	printf("--------------------------------------------------------------------------------");
	printf("\t\t  Производится проверка файлов таблицы\n\n");
	printf("--------------------------------------------------------------------------------");
	file = fopen("Spisok #.txt","r");
	if (!file) 
	{
		m = 0;
		printf("Ошибка при открытии файла или файла БД не существует\n");
		printf("Будет создан новый пустой файл БД #\n");
		printf("--------------------------------------------------------------------------------\n");
		system("pause");
		file = fopen("Spisok #.txt","w"); // Создаем чистый файл
		fclose(file);
		file = fopen("Spisok #.txt","r");
	}
	fseek(file,0,SEEK_END);
	l = ftell(file); // Размер файла
	if (l!=0) l = 1; // Если файл не пустой, то параметр устанавливаем на 1
	switch(l)
	{
	case 0:
		fclose(file);
		if (m==1)
		{
			printf("Файл БД # пуст\n");
			printf("Введите в него данные\n");
			printf("--------------------------------------------------------------------------------\n");
			system("pause");
		}
		vvod_empty_diez(); // Ввод в пустой файл
		break;
	case 1:
		fclose(file);
		printf("--------------------------------------------------------------------------------\n");
		printf("Файл для аккордов # уже содержит данные\nНажмите 1 чтобы очистить файл и ввести новые данные или\n0 для продолжения работы\n");
		printf("--------------------------------------------------------------------------------\n");
		do
		{
		c = getch();
		__asm
		{
			xor ecx,ecx
			mov cl,c
			sub ecx,0x30
			xor eax,eax
			add eax,ecx
			mov i,eax
		}
		}while(i!=1 && i!=0);
		if (i==1) vvod_empty_diez(); 
		break;
	}
	file = fopen("Spisok bemol.txt","r");
	if (!file) 
	{
		m = 0;
		printf("--------------------------------------------------------------------------------");
		printf("Ошибка при открытии файла или файла БД не существует\n");
		printf("Будет создан новый пустой файл БД бемоль\n");
		printf("--------------------------------------------------------------------------------");
		system("pause");
		file = fopen("Spisok bemol.txt","w"); // Создаем чистый файл
		fclose(file);
		file = fopen("Spisok bemol.txt","r");
	}  
	fseek(file,0,SEEK_END);
	l = ftell(file);
	if (l!=0) l = 1;
	switch(l)
	{
	case 0:
		fclose(file);
		if (m==1)
		{
			printf("--------------------------------------------------------------------------------");
			printf("Файл БД бемоль пуст\n");
			printf("Введите в него данные\n");
			printf("--------------------------------------------------------------------------------\n");
			system("pause");
		}
		vvod_empty_bemol(); // Ввод в пустой файл
		break;
	case 1:
		fclose(file);
		printf("--------------------------------------------------------------------------------\n");
		printf("Файл для аккордов бемоль уже содержит данные\nНажмите 1 чтобы очистить файл и ввести новые данные или\n0 для продолжения работы\n");
		printf("--------------------------------------------------------------------------------\n");
		do
		{
		c = getch();
		__asm
		{
			xor ecx,ecx
			mov cl,c
			sub ecx,0x30
			xor eax,eax
			add eax,ecx
			mov i,eax
		}
		}while(i!=1 && i!=0);
		if (i==1) vvod_empty_bemol(); 
		break;
	}
	system("cls");
}