#include <stdio.h>
#include "Sort_akk.h"

void sortirovka()
{
	int i,j;
	char c;
	printf("--------------------------------------------------------------------------------");
	printf("\t\t   Здесь вы можете отсортировать базу данных\n");
	printf("--------------------------------------------------------------------------------");
	printf("\n\t\t\tВыберите систему аккордов\n");
	printf("\n\t\t\t---------------------------\n");
	printf("\t\t\t\t1. Диез #\n");
	printf("\t\t\t---------------------------\n");
	printf("\n\t\t\t---------------------------\n");
	printf("\t\t\t\t2. Бемоль\n");
	printf("\t\t\t---------------------------\n");
	printf("\n\t\t\t---------------------------\n");
	printf("\t\t\t\t3. Выход в меню\n");
	printf("\t\t\t---------------------------\n");
	do
	{
		c = getch();
		__asm
		{
			xor ecx,ecx
			mov cl,c
			sub ecx,0x30
			xor	eax,eax
			add eax,ecx
			mov i,eax
		}
	}while(i!=1 && i!=2 && i!=3);
	if (i==3) 
	{
		system("cls");
		return;
	}
	printf("--------------------------------------------------------------------------------");
	printf("Выберите сортировку: по частоте(1) по ступени(2)\n");
	printf("--------------------------------------------------------------------------------");
	do
	{
		c = getch();
		__asm
		{
			xor ecx,ecx
			mov cl,c
			sub ecx,0x30
			xor	eax,eax
			add eax,ecx
			mov j,eax
		}
	}while(j!=1 && j!=2);
	if (i==1 && j==1) sort_diez_frequency(); // Сортировка списка аккордов с диезами по частоте
	else if (i==1 && j==2) sort_diez_stupen(); // Сортировка списка аккордов с диезами по ступени
	if (i==2 && j==1) sort_bemol_frequency(); // Сортировка списка аккордов с бемолями по частоте
	else if (i==2 && j==2) sort_bemol_stupen(); // Сортировка списка аккордов с бемолями по ступени
}