#include <stdio.h>
#include <conio.h>
#include "Del_akk.h"

void vyzov_diez()
{
	char c;
	int i,k;
	printf("--------------------------------------------------------------------------------");
	printf("\t\t\tВозможные варианты удаления данных\n");
	printf("--------------------------------------------------------------------------------");
	printf("\n\t\t\t---------------------------------\n");
	printf("\t\t\t\t1. Из верха списка\n");
	printf("\t\t\t---------------------------------\n");
	printf("\n\t\t\t---------------------------------\n");
	printf("\t\t\t\t2. Из низа списка\n");
	printf("\t\t\t---------------------------------\n");
	printf("\n\t\t\t---------------------------------\n");
	printf("\t\t\t\t3. Удаление по названию\n");
	printf("\t\t\t---------------------------------\n");
	do
	{
	c = getch();
	__asm
	{
		xor ecx,ecx
		mov cl,c
		sub ecx,0x30
		xor eax,eax
		add eax,ecx
		mov i,eax
	}
	}while(i!=1 && i!=2 && i!=3);
	if(i==1 || i==2)
	{
		printf("--------------------------------------------------------------------------------");
		printf("Сколько строк данных требуется удалить?  ");
		scanf("%d",&k);
		printf("--------------------------------------------------------------------------------");
	}
	switch(i)
	{
	case 1:
		system("cls");
		i = del_verx_diez(k);
		break;
	case 2:
		system("cls");
		i = del_niz_diez(k);
		break;
	case 3:
		system("cls");
		i = del_opred_diez();
		break;
	}
	if (i==0) 
	{
		system("cls");
		printf("--------------------------------------------------------------------------------");
		printf("\t\t\tУдаление данных успешно завершено\n");
		printf("--------------------------------------------------------------------------------");
		return;
	}
	if (i==1) 
	{
		printf("--------------------------------------------------------------------------------");
		printf("\t\t\tУдаление данных не было проведено\n");
		printf("--------------------------------------------------------------------------------");
		return;
	}
	getch();
	system("cls");
}